{"/art/":{"data":{"":"Website in progress!"},"title":"Art projects"},"/games/":{"data":{"":"Here’s some of the gaming-related projects I’ve been a part of: {{ $image := resources.Get “images/sunset.jpg” }}\nWacky-quarium (2025)aquascaping city builder…but it gets weird | lead developer Agents of Interest (2025)cyberpunk visual novel with secret agents | background artist Clone (2020)puzzle game where you move two characters with one button | main artist, associate developer Cutscene production for Behavioral Research project (2020)recording cutscenes gets tedious, let’s build Unity Timeline tools to help | main programmer Project Landships (2018)two players control a tank together and fight other tanks in VR | associate developer Mika's Forest (2016)puzzle game where you send out animals to reclaim the land | solo developer"},"title":"Games and related projects"},"/games/agents/":{"data":{"":"“A visual novel in a cyberpunk setting where you play a secret agent with the power to control time. Has multiple endings based on player choice.”\nTitle: Background Artist\nPlatforms: Browser, PC\nEngine and tools: Ren’py, Clip Studio Paint\nAchievements: Ranked #33 of 121 game jam entries\nProject page: https://aceofclub.itch.io/agents-of-interest\nFor Agents of Interest, I drew the title screen and the 11 backgrounds (non-character work) used throughout the visual novel. I worked with 5 other people who handled the character art, coding, music, writing and project management, and completed these drawings over two weeks.\nThis was my first completed game or art project in several years, and was a good return to what I enjoy about drawing and game development. I utilized real-life references for the external architecture, mainly hotels around my local area, but reimagined the interiors in a futuristic setting, taking inspiration from Cyberpunk 2077. I thoroughly enjoyed painting the lighting and learned a lot from my references. Most of the story had already been written by the time I joined the team, but in future projects I would love to be more creatively involved with the planning of the game."},"title":"Agents of Interest"},"/games/aquarium/":{"data":{"":"“Wacky-quarium is a city builder where you start out building an aquascape to attract beneficial alien sea creatures…but the sea creatures might have a mind of their own.”\nIntended platforms: PC\nEngine: Unreal\nTitle: Lead Developer\nWacky-quarium is my current project right now. Currently it’s at a state where it’s playable, but I’m missing a lot of the key ‘fun’ mechanics. The plan right now is to build out a prototype to test the ‘fun’ factor and then find collaborators to help me finish up and add polish.\nIn Wacky-quarium, you are an aquascaper trying to populate a biosphere on an alien planet. You start with a grid where you can place structures, like shells and plants. As you place structures down, creatures that are able to live in the conditions you’ve created will become residents of your biosphere. These fish will create resources that will help you support more variety of fish and build new structures.\nThe weird part is that your creatures might develop strange wants and needs that might be hard to satisfy. We have enough plants to provide food for our habitat, but what about the squids clamoring for a data archive? As the habitat progresses, you’ll need to strategically build and destroy structures, as well as invite and replace inhabitants, in order to fulfill the needs requested of you while keeping your fish alive and happy."},"title":"Wacky-quarium"},"/games/clone/":{"data":{"":"“Clone is a 20-level puzzle game in which a boy gets lost in a forest and must find a way out. Along the way, he meets more lost individuals and can choose how to interact with them, leading to multiple endings.”\nTitle: Main Artist, Associate Developer\nPlatforms: Browser, PC\nEngine and tools: Unity, Clip Studio Paint\nProject page: https://brian-royston.itch.io/clone\nFor Clone, my main contributions were in drawing most of the art for the game. I drew most of the tiles and characters and created 2D animations for them in Unity, along with creating the ending cutscenes. Most of the game logic code was done by the other teammates, but I did implement the dialogue system and added logic to track character responses and deliver the alternate endings.\nOur goal in making this game was to build an interesting puzzle game with a small story element. The box puzzles were inspired by Baba is You and the story element is inspired by the game Catherine, where you can meet NPCs after doing puzzle sections and choose to comfort or chastise them. The player controlling the main character and another character with inverted controls is inspired by older flash games.\nFor the art direction, I wanted to stick with cool-toned colors to reflect the somber, mystical mood of the game. We wanted the main character, Pero, to seem like a normal person lost in a strange place, so that went into his relatively simple design with an orange jacket to contrast the green levels.\nClone was developed as part of the Game Development and Design DeCal at Berkeley, a student-run class where groups of four were tasked with developing a game together, while learning about art and game development best practices."},"title":"Clone"},"/games/landships/":{"data":{"":"“A co-op multiplayer VR game in which two players control a tank as driver and gunner, and fight against other player-controlled tanks. “\nTitle: Associate Developer\nPlatforms: Oculus Rift (VR)\nEngine and tools: Unity, Photon Engine\nFor Project Landships, I tested out a variety of different networking options and tuned them. I would create different versions of the Unity project and mess around with settings, for example, changing which objects were tracked by the server or changing how they would communicate with the server, until we found something promising.\nThis was a multi-year long project run by a club in my university and had substantial work put into it before I joined. I joined for a semester and worked with four other people to make the existing VR tank battle game into a co-op multiplayer game.\nThere were many design challenges associated with this project: for example, the driver and gunner both pulled physics-based levers to control the tank. We had to decide if we wanted the state of the levers to be networked or if it would be local, and both options had drawbacks. A common issue was having the gunner and the driver de-sync and experience different states of the tank location at the same time. There was also the hassle of testing, as we had to use 2-3 computers and 2 people in order to run the multiplayer server and test two Oculus hosts controlling at the same time.\nThe design challenges were honestly the largest of the issues with making the game multiplayer - once we had worked out the quirks, Photon Engine took care of the rest and handled most of the networking complexity."},"title":"Project Landships"},"/games/mikas/":{"data":{"":"“Mika’s Forest is a puzzle game created for Mini Ludum Dare #69 where you try to flip all the tiles in a level as other creatures attempt to flip them back.”\nTitle: Solo Developer\nPlatforms: PC\nEngine and tools: Unity\nProject page: https://xytheria.itch.io/mikas-forest"},"title":"Mikas Forest"},"/games/vrxdfc/":{"data":{"":"“Animated 16 cutscenes using Unity Timeline to simulate different scenarios from the perspective of a user in a VR social space.”\nTitle: Main Programmer\nEngine and tools: Unity, Unity EditorTools and Timeline\nFor this project, I used Unity Timeline to create cutscenes that would then be recorded into videos and used for social research. The cutscenes were each 2-8 minutes long and involved several characters moving in and out of frame, camera panning, voice lines with spatial audio, and particle effects. I moved the models to record keyframes and inserted audio or effects as the scripts dictated.\nThe project required certain scenarios to share significant portions of animation so I explored the EditorTools API in Unity and built some functionality to cut and paste keyframes, which was extremely useful and enabled me to distribute animation work to the other members of the research group.\nThis work was part of a research group of 4 undergrad students led by Vivek Rao under the UC Berkeley Design for Cybersecurity group. Each cutscene scenario would present the situation that you were in a VR social space (like VRChat) and you would watch other people’s digital avatars commit social fallacies and then be subjected to moderation. For example, in some scenarios a moderator player might explain the rule violation and mute the violator, and in other scenarios the rule violator would just disappear. Sometimes there would be no moderator and the scenario would indicate that other players were choosing to mute the violator individually. The research study intended to show these scenarios to people and discover people’s preferences of moderation on these scales (opaque vs transparent rules, centralized vs decentralized moderation, etc).\nWe completed making cutscenes and were in the process of designing the trial. I don’t know if this study was ever conducted as it was interrupted by several factors, namely the COVID-19 pandemic."},"title":"Cutscene Design and Implementation for Behavioral Study"}}